app/views/incident_reports/index.html.erb

              <%= f.label :source %>
              <%= f.select :source_eq, options_for_select([['Any','']] + IncidentReport::SOURCE ), {}, {class: 'form-control select2'} %>
---
SELECT "incident_reports".* FROM "incident_reports"