app/views/users/index.html.erb

                    <span class="input-group-addon">Role </span>
                    <%= f.select :role_cont, options_for_select([['Any','']] + User::ROLES), {}, {class: 'form-control select2', style: 'display:none'}%>
---
SELECT "users".* FROM "users"