app/controllers/incident_reports_controller.rb

SELECT DISTINCT COUNT(DISTINCT "incident_reports"."id") FROM "incident_reports"
---
  def index
    @q = IncidentReport.ransack(params[:q])
    @incident_reports = @q.result(distinct: true).page(params[:page]).per(params[:per_page])

INSERT INTO "incident_reports" ("service_impact", "problem_details", "how_detected", "source", "rank", "loss_related", "occurred_reason", "overlooked_reason", "recovery_action", "prevent_action", "recurrence_concern", "current_status", "measurer_status", "user_id", "occurrence_time", "detection_time", "recovery_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@incident_report = IncidentReport.new(incident_report_params)
    @incident_report = current_user.IncidentReports.build(incident_report_params)
    respond_to do |format|
      if @incident_report.save

UPDATE "incident_reports" SET "service_impact" = ?, "problem_details" = ?, "how_detected" = ?, "rank" = ?, "loss_related" = ?, "occurred_reason" = ?, "overlooked_reason" = ?, "recovery_action" = ?, "prevent_action" = ?, "occurrence_time" = ?, "detection_time" = ?, "recovery_time" = ?, "updated_at" = ? WHERE "incident_reports"."id" = ?
---
  def update
    respond_to do |format|
      if @incident_report.update(incident_report_params)

SELECT  "incident_reports".* FROM "incident_reports" WHERE "incident_reports"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_incident_report
      @incident_report = IncidentReport.find(params[:id])