app/controllers/users_controller.rb

  def index
    @q = User.ransack(params[:q])
    @users = @q.result(distinct: true).page(params[:page])
             .per(params[:per_page])
---
SELECT DISTINCT COUNT(DISTINCT "users"."id") FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 25]]

  def update
    @user = User.find params[:id]
    if @user.update(update_user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 25]]
UPDATE "users" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "user6@email.com"], ["encrypted_password", "$2a$10$mNEaiwECK7qwBe64qsfNW.kvxNSfl55vsrKIqfTVTUuK2wozrTX5S"], ["updated_at", "2015-06-22 06:56:42.383718"], ["id", 45]]

  def destroy
    @user = User.find params[:id]
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 25]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 26]]

  def lock_user
    @user = User.find params[:id]
    @user.update_attribute(:locked_at, Time.current)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 25]]
UPDATE "users" SET "locked_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["locked_at", "2015-06-22 04:18:41.361733"], ["updated_at", "2015-06-22 04:18:41.362315"], ["id", 40]]

  def unlock_user
    @user = User.find params[:id]
    @user.update_attribute(:locked_at, nil)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 40]]
UPDATE "users" SET "locked_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["locked_at", nil], ["updated_at", "2015-06-22 07:25:40.675917"], ["id", 41]]